{"pages":[{"title":"About","text":"目前就读于武汉大学，即将当一名出国狗。 博客用来记录生活和技术，欢迎大家一起交流。 有问题请联系我：shuoc1218@163.com","link":"/about/index.html"}],"posts":[{"title":"Say goodbye to 2018","text":"2018年还有20多天结束了，刚好在这天迎来了自己20岁的生日，人生这么快就过去了六分之一。每思致此，我还有些惆怅。 正好最近在研究 hexo+github 搭建自己的个人博客，就以此作为博客的第一篇。 总的来评价，我的2018年过的还是比较有意义的。年头我就想要在这一年里面把之前没有时间去完成的事情多完成几件，尽量去尝试多种不同的有意义的事情。 上半年主要是上专业课+学习爬虫，虽然爬虫知识到现在为止漏洞还是很多。这门兴趣我是在大学生科研阶段培养起来的，偶然网上看到静谧大神，跟着他的博客一步步学习下去，有一点小小的成果和经验，但是尚缺的还是从一个系统来整体学习。在这段时间里面，我记得当时准备考研的同学已经开始着手准备了，那时的我也是准备考研的，但是我一点不慌，每天也是跟着他们去图书馆，看博客、读爬虫书、亲自实验，玩的有滋有味。 三月份的时候接触到了一群玩街头健身的朋友，每天基本无特殊情况的话都会在信操一起锻炼。接触的途径是有一天晚上闲的无聊去东湖散步，突然想到咱们学校有没有那种健身社团，于是打开qq群在附近搜索“武大健身”关键字，然后就加入了组织。在这个圈子中，大家三观都很正，而且都是那种积极上进的人，无论在健身还是学习方面，所以自己还是比较喜欢这里的。 一直到暑假前夕，我才开始关注一下未来的出路了，当时自己还在张同学的CS鼓吹论下考虑要不要转浙大计算机，也了解了一下北航、复旦、浙大、中科大这些学校的计算机专业，都蛮强的 (这是废话)，甚至还一时冲动还在某二手平台买了408专业课的复习资料准备开始复习，后来由于个人懒惰原因没能坚持读下去。 为了调适心情（玩+赚钱），我参加了某研学公司去参加带小孩子夏令营兼职了，5天湖南游，大夏天舍命陪孩子玩儿，赚了几百块钱，那时候头哥和zy也在湖南的公司实习，但是由于我这边比较忙连见面时间都没有。完成兼职之后还是没开始复习，又头铁去参加了感知成都的暑期实践，成都毕竟一直以来也是我想去的地方，有美食，美女，美景还有萌萌的大熊猫，一个礼拜的成都之行还是蛮巴适的。 再后来已经到了7月10几号了，开始紧张起来，一开始准备在学校复习考研的，但是每天感觉睡眠不好，也可能由于夏天到了心思静不下来，想回去学习了。回去之后果不其然，睡眠挺好的，每天睡觉睡的起不来，懒惰的要死，低效率的学了两个礼拜之后又在7月底早早的来到了学校。当时香蕉哥正一起复习，那段时间是整个一学年的高效时期，每天生活很规律，学的很有劲，而且每天还能抽出时间一起锻炼。 开学后，一个转折点出现了。那段时间我们大学生科研要结题了，就去找桂老师聊了一聊了。那天聊结题的内容什么的我忘了，但是记得的是就是这次聊天把我从考研拉回了出国(哎，真是一个善变的男人)。当时花了几天考虑了一下，毕竟之前复习的还是卓有成效的，记得是在欢乐谷的S1000过山车上考虑清楚的。 从那以后我就开始准备各种材料，看学校信息，准备德国的留学审核部审核(好像到现在为止还没开始复习)。每天写材料写的痛苦不堪，拿给czy改的时候又被diss好久，导致我很失落那段时间。但是还好，虽然英文写作是比较菜，但是慢慢磨，总会有个材料出来。拿着这份材料交了几个学校，录了一个港理工(我记得还把academic后面多加了一个e)。本来准备拿这个学校保底的，但是这货居然让我12月份交留位费，上了张鬼子的当，然后又提交了几个学校，这些还在等结果，希望这个月能再收到几个offer稳稳军心吧，当然自己的梦校还是TUM。 其实每条路都有存在的意义，坚持走完都有成果的。无论未来碰到什么石头，都一定要自信的走下去，不动摇。Follow your heart and achieve your goals. 2018年12月6日 于 武汉大学信息学部图书馆","link":"/2018/12/06/Say good bye to 2018/"},{"title":"Markdown的基本用法介绍","text":"markdown语言是一种纯文本格式语言，通过简单的标记语法，它可以使普通文本具有一定的格式。本博客使用的就是该种语言。为此，我们有必要熟悉一下这种语言，下面我们花5分钟时间来简单了解一下吧。 一. 标题12345# 一级标题## 二级标题### 三级标题...###### 最多能支持六级标题 这里需要注意的是，#后面要跟个空格再写文字。 二. 字体 加粗 在要加粗的文字左右分别用两个**包起来。 或按快捷键Ctrl+B 斜体 在要倾斜的文字左右分别用一个*包起来。 或按快捷键Ctrl+I 斜体加粗 加起来就是左右三个* 啦 或快捷键两个先后使用 删除线 删除内容左右分别用两个~~包起来。 或快捷键Alt+Shift+5 三. 引用在引用的文字前加&gt;即可。引用可以嵌套，如加两个&gt;&gt;三个&gt;&gt;&gt;，不限制数量。 这是引用内容 这也是引用内容 四.分割线 使用三个或三个以上的-或是*。 效果完全相同 五. 图片1234![alt](图片地址 &apos;&apos;title&apos;&apos;)![blockchain](https://ss0.bdstatic.com/70cFvHSh_Q1YnxGkpoWK1HF6hhy/it/u=702257389,1274025419&amp;fm=27&amp;gp=0.jpg &quot;区块链&quot;)alt是图片下面显示的标题，title是鼠标移动到图片上显示的文字，title可省略 六. 超链接12[超链接名](超链接地址 &quot;超链接title&quot;)title可省略 百度 七.列表 无序列表 用 -、+、*任何一种效果相同，注意后面跟空格再加文字。 1- 测试1 测试2 有序列表 用数字加.，序号和内容之间有空格。 列表嵌套 上一级和下一级之间敲三个空格 一级无序 二级无序 三级无序 一级有序​ 二级无序​ 二级无序 八. 表格123456789101112131415表头|表头|表头-|:-:|-:内容|内容|内容内容|内容|内容第二行分割表头和内容文字默认居左，两边加：居中，右边加：居右注：原生的语法两边都要用|包起来实例：姓名|技能|排行--|:--:|--:刘备|哭|大哥关羽|打|二哥张飞|骂|三弟 姓名 技能 排行 刘备 哭 大哥 关羽 打 二哥 张飞 骂 三弟 九.代码单行代码：代码之间分别用一个反引号`包起来 create database heros 代码块：用三个反引号`包起来,且引号要单独占一行 1234#include&lt;stdio.h&gt;void main{ printf(&quot;hello world&quot;);} 十. 流程图123456789​```flowst=&gt;start: 开始op=&gt;operation: My Operationcond=&gt;condition: Yes or No?e=&gt;endst-&gt;op-&gt;condcond(yes)-&gt;econd(no)-&gt;op&amp; 123456789101112```flowst=&gt;start: 开始op=&gt;operation: My Operationcond=&gt;condition: Yes or No?e=&gt;endst-&gt;op-&gt;condcond(yes)-&gt;econd(no)-&gt;op&amp; ` 后续再编辑过程中若还有新用法持续更新…","link":"/2018/12/08/markdown基本用法/"}],"tags":[{"name":"年度总结","slug":"年度总结","link":"/tags/年度总结/"},{"name":"博客搭建","slug":"博客搭建","link":"/tags/博客搭建/"}],"categories":[{"name":"生活随笔","slug":"生活随笔","link":"/categories/生活随笔/"},{"name":"技术杂谈","slug":"技术杂谈","link":"/categories/技术杂谈/"}]}