{"pages":[{"title":"About","text":"目前就读于武汉大学，即将当一名出国狗。 博客用来记录生活和技术，欢迎大家一起交流。 有问题请联系我：shuoc1218@163.com","link":"/about/index.html"}],"posts":[{"title":"Say goodbye to 2018","text":"2018年还有20多天结束了，刚好在这天迎来了自己20岁的生日，人生这么快就过去了六分之一。每思致此，我还有些惆怅。 正好最近在研究 hexo+github 搭建自己的个人博客，就以此作为博客的第一篇。 总的来评价，我的2018年过的还是比较有意义的。年头我就想要在这一年里面把之前没有时间去完成的事情多完成几件，尽量去尝试多种不同的有意义的事情。 上半年主要是上专业课+学习爬虫，虽然爬虫知识到现在为止漏洞还是很多。这门兴趣我是在大学生科研阶段培养起来的，偶然网上看到静谧大神，跟着他的博客一步步学习下去，有一点小小的成果和经验，但是尚缺的还是从一个系统来整体学习。在这段时间里面，我记得当时准备考研的同学已经开始着手准备了，那时的我也是准备考研的，但是我一点不慌，每天也是跟着他们去图书馆，看博客、读爬虫书、亲自实验，玩的有滋有味。 三月份的时候接触到了一群玩街头健身的朋友，每天基本无特殊情况的话都会在信操一起锻炼。接触的途径是有一天晚上闲的无聊去东湖散步，突然想到咱们学校有没有那种健身社团，于是打开qq群在附近搜索“武大健身”关键字，然后就加入了组织。在这个圈子中，大家三观都很正，而且都是那种积极上进的人，无论在健身还是学习方面，所以自己还是比较喜欢这里的。 一直到暑假前夕，我才开始关注一下未来的出路了，当时自己还在张同学的CS鼓吹论下考虑要不要转浙大计算机，也了解了一下北航、复旦、浙大、中科大这些学校的计算机专业，都蛮强的 (这是废话)，甚至还一时冲动还在某二手平台买了408专业课的复习资料准备开始复习，后来由于个人懒惰原因没能坚持读下去。 为了调适心情（玩+赚钱），我参加了某研学公司去参加带小孩子夏令营兼职了，5天湖南游，大夏天舍命陪孩子玩儿，赚了几百块钱，那时候头哥和zy也在湖南的公司实习，但是由于我这边比较忙连见面时间都没有。完成兼职之后还是没开始复习，又头铁去参加了感知成都的暑期实践，成都毕竟一直以来也是我想去的地方，有美食，美女，美景还有萌萌的大熊猫，一个礼拜的成都之行还是蛮巴适的。 再后来已经到了7月10几号了，开始紧张起来，一开始准备在学校复习考研的，但是每天感觉睡眠不好，也可能由于夏天到了心思静不下来，想回去学习了。回去之后果不其然，睡眠挺好的，每天睡觉睡的起不来，懒惰的要死，低效率的学了两个礼拜之后又在7月底早早的来到了学校。当时香蕉哥正一起复习，那段时间是整个一学年的高效时期，每天生活很规律，学的很有劲，而且每天还能抽出时间一起锻炼。 开学后，一个转折点出现了。那段时间我们大学生科研要结题了，就去找桂老师聊了一聊了。那天聊结题的内容什么的我忘了，但是记得的是就是这次聊天把我从考研拉回了出国(哎，真是一个善变的男人)。当时花了几天考虑了一下，毕竟之前复习的还是卓有成效的，记得是在欢乐谷的S1000过山车上考虑清楚的。 从那以后我就开始准备各种材料，看学校信息，准备德国的留学审核部审核(好像到现在为止还没开始复习)。每天写材料写的痛苦不堪，拿给czy改的时候又被diss好久，导致我很失落那段时间。但是还好，虽然英文写作是比较菜，但是慢慢磨，总会有个材料出来。拿着这份材料交了几个学校，录了一个港理工(我记得还把academic后面多加了一个e)。本来准备拿这个学校保底的，但是这货居然让我12月份交留位费，上了张鬼子的当，然后又提交了几个学校，这些还在等结果，希望这个月能再收到几个offer稳稳军心吧，当然自己的梦校还是TUM。 其实每条路都有存在的意义，坚持走完都有成果的。无论未来碰到什么石头，都一定要自信的走下去，不动摇。Follow your heart and achieve your goals. 2018年12月6日 于 武汉大学信息学部图书馆","link":"/2018/12/06/Say good bye to 2018/"},{"title":"deep learning ai notes","text":"Coursera Enda Wu: Courses in this sequence(Specialization): Neural Networks and Deep Learning Improving Deep Neural Networks: Hyperparameter tuning, Regularization and Optimization. Structuring your Machine Learning project. Convolutional Neural Networks. Natural Language Processing: Building Sequence Models 1.Neural Networks and Deep Learningweek 1Relu(rectified linear unit) $max(0,w^Tx+b)$ Different types of neural network: CNN(Convolutional Neural Network) used often for image application and RNN(Recurrent Neural Network) used often for one-dimension sequence data such as text transcript. Hybrid neural network architecture for autonomous driving. Structured and Unstructured data Structured data refers to things that has a defined meaning, such as price and age. Unstructured data refers to things like pixel, raw audio, text. outline of this course week 1: Introduction week 2: Basic of Neural Network programming week 3: One hidden layer Neural Networks week 4: Deep Neural Networks week 2 logistic regression","link":"/2018/12/11/courseradl/"},{"title":"labelme","text":"labelme的安装和使用因为最近是本科毕业设计开题，我的毕设题目是融合遥感影像和GPS轨迹数据的道路提取，涉及到深度学习来提取影像信息，数据源需要用labelme来进行标注。 labelme是MIT开源的一款标注软件，官方的github地址为https://github.com/wkentaro/labelme. 一. 安装过程本文介绍labelme在windows下的安装过程。 在Windows系统下，首先安装anaconda, 官网下载 https://www.anaconda.com/ ，博主这里下载的是3.7版本，安装过程中记得把添加到系统路径勾上，否则就安装完成之后手动添加。 安装完成之后，开始菜单打开anaconda prompt, 输入以下命令。 12345# python3conda create --name=labelme python=3.7activate labelmeconda install pyqt # pyqt5 can be installed via pip on python3pip install labelme # use &apos;pip install&apos; instead of &apos;conda install&apos; 安装至此结束，是不是很简单呢。 二.使用方法Labelme可对图像进行矩形标注和多边形标注，生成的文件是json文件。 在anaconda prompt 窗口下继续输入命令： labelme 即可打开labelme的图形界面。 仔细观察的话，可以发现左上角是一个Lena.jpg哦。","link":"/2018/12/11/labelme/"},{"title":"Markdown的基本用法介绍","text":"markdown语言是一种纯文本格式语言，通过简单的标记语法，它可以使普通文本具有一定的格式。本博客使用的就是该种语言。为此，我们有必要熟悉一下这种语言，下面我们花5分钟时间来简单了解一下吧。 一. 标题12345# 一级标题## 二级标题### 三级标题...###### 最多能支持六级标题 这里需要注意的是，#后面要跟个空格再写文字。 二. 字体 加粗 在要加粗的文字左右分别用两个**包起来。 或按快捷键Ctrl+B 斜体 在要倾斜的文字左右分别用一个*包起来。 或按快捷键Ctrl+I 斜体加粗 加起来就是左右三个* 啦 或快捷键两个先后使用 删除线 删除内容左右分别用两个~~包起来。 或快捷键Alt+Shift+5 三. 引用在引用的文字前加&gt;即可。引用可以嵌套，如加两个&gt;&gt;三个&gt;&gt;&gt;，不限制数量。 这是引用内容 这也是引用内容 四.分割线 使用三个或三个以上的-或是*。 效果完全相同 五. 图片1234![alt](图片地址 &apos;&apos;title&apos;&apos;)![blockchain](https://ss0.bdstatic.com/70cFvHSh_Q1YnxGkpoWK1HF6hhy/it/u=702257389,1274025419&amp;fm=27&amp;gp=0.jpg &quot;区块链&quot;)alt是图片下面显示的标题，title是鼠标移动到图片上显示的文字，title可省略 六. 超链接12[超链接名](超链接地址 &quot;超链接title&quot;)title可省略 百度 七.列表 无序列表 用 -、+、*任何一种效果相同，注意后面跟空格再加文字。 1- 测试1 测试2 有序列表 用数字加.，序号和内容之间有空格。 列表嵌套 上一级和下一级之间敲三个空格 一级无序 二级无序 三级无序 一级有序​ 二级无序​ 二级无序 八. 表格123456789101112131415表头|表头|表头-|:-:|-:内容|内容|内容内容|内容|内容第二行分割表头和内容文字默认居左，两边加：居中，右边加：居右注：原生的语法两边都要用|包起来实例：姓名|技能|排行--|:--:|--:刘备|哭|大哥关羽|打|二哥张飞|骂|三弟 姓名 技能 排行 刘备 哭 大哥 关羽 打 二哥 张飞 骂 三弟 九.代码单行代码：代码之间分别用一个反引号`包起来 create database heros 代码块：用三个反引号`包起来,且引号要单独占一行 1234#include&lt;stdio.h&gt;void main{ printf(&quot;hello world&quot;);} 十. 流程图123456789​```flowst=&gt;start: 开始op=&gt;operation: My Operationcond=&gt;condition: Yes or No?e=&gt;endst-&gt;op-&gt;condcond(yes)-&gt;econd(no)-&gt;op&amp; 123456789101112```flowst=&gt;start: 开始op=&gt;operation: My Operationcond=&gt;condition: Yes or No?e=&gt;endst-&gt;op-&gt;condcond(yes)-&gt;econd(no)-&gt;op&amp; ` 后续再编辑过程中若还有新用法持续更新…","link":"/2018/12/08/markdown基本用法/"},{"title":"浅谈机器学习与深度学习中的算法原理(一)","text":"当今社会，各行各业无不涉及人工智能和机器学习，掌握其中的基本原理知道如何应用至关重要，同时也是求职者必备技能。本系列博客旨在介绍机器算法和深度学习的基本原理，为进行更深层次的应用打下基础。 本篇文章主要介绍传统学习和机器学习的内容和主要区别。 什么是机器学习？机器学习的定义“A computer program is said to learn from experience E with respect tosome class of tasks T and performance measure P if its performance attasks in T, as measured by P, improves with experience E ” 翻译过来是“一个电脑程序要完成任务(T),如果电脑获取的关于T的经验(E)越多就表现得(P)越好,那么我们就可以说这个程序学习了”。 更直白一点：“经验越多，学习越好”。 比如：根据身高预测体重，根据气压、湿度、风力等预测降雨概率等。 这里需要注意的是，这些机器学习的特征，是人工提前设置好的，在进行这项工作之前，是由人类专家根据自己的以往经验来选取的重要的特征，然后机器通过分析这些特征的历史数据，来找到相应的模式，即不同特征组合下的不同结果。 什么是深度学习？深度学习的定义 “Deep learning is a particular kind of machine learning that achieves great power and flexibility by learning to represent the world as nested hierarchy of concepts, with each concept defined in relation to simpler concepts, and more abstract representations computed in terms of lessabstract ones.” 翻译过来是“深度学习是一种特殊的机器学习，它可以获得高性能也十分灵活。它可以用概念组成的网状层级结构来表示这个世界，每一个概念更简单的概念相连，抽象的概念通过没那么抽象的概念计算。” 以人类判断方形和圆形为例，在判断过程中，我们首先看这个形状有没有四条边，有的话进一步判断是否垂直，是否等长。如果以上条件都能满足，则是一个这正方形。在这个过程中，我们的大脑自动将识别的整个复杂的任务分为了几个简单的小块。 传统机器学习与深度学习有何区别？在识别猫和狗的过程中，若使用传统机器学习的算法，我们需要定义一些特征，告诉机器从哪些方面进行判断，比如，胡须、耳朵、鼻子、嘴巴的模样。首先要确定相应的面部特征，作为机器学习的特征，以便分类判断。 而深度学习的工作流程如下：1. 首先确定出有哪些边和角跟识别出猫狗关系最大; 2.根据上一步找出的很多小元素（边、角等）构建层级网络，找出它们之间的各种组合; 3.在构建层级网络之后，就可以确定哪些组合可以识别出猫和狗。 深度学习方法的优越性就体现在，它能自动找到这个问题所需要的重要特征，而传统机器学习需要手工的给出特征。 以人脸识别为例：可以看到4层，输入的是Raw Data，就是原始数据，这个机器没法理解。于是，深度学习首先尽可能找到与这个头像相关的各种边，这些边就是底层的特征（Low-level features），这就是上面写的第一步；然后下一步，对这些底层特征进行组合，就可以看到有鼻子、眼睛、耳朵等等，它们就是中间层特征（Mid-level features），这就是上面写的第二步；最后，我们队鼻子眼睛耳朵等进行组合，就可以组成各种各样的头像了，也就是高层特征（High-level features）这个时候就可以识别出或者分类出各种人的头像了。 对比机器学习和深度学习，可以发现以下不同点： 数据依赖 随着数据量增加，两者表现有很大区别： 数据集较大时，可以使用深度学习方法；数据集较小，用传统机器学习方法或许更合适。 硬件依赖 深度学习十分依赖于高端的硬件设施，因为计算量巨大。深度学习涉及很多矩阵运算，因此很多深度学习都涉及GPU运算，对比之下，机器学习要求配置较低。 特征工程 在机器学习中，几乎所有特征都业内专家确定，手工对特征进行编码量化。 深度学习中，算法自动从数据中学习特征，大大降低发现特征的成本。 解决问题的方式 传统机器学习算法需要将问题分成几块，一个个解决好之后重新组合起来。 深度学习端到端，一次性解决好。 在物体检测方面，机器学习做法分两步，发现物体（找到物体的位置），识别物体（确定是什么类型的物体）。而在深度学习中，给它一张图，它能直接把物体识别出来，同时标明物体的名字，如yolo算法。 运行时间 深度学习需要花大量时间来训练，ResNet需要两周时间训练。机器学习几秒钟到几个小时就可以训练好。但是机器学习模型一旦训练好，在预测任务上面就会表现很快，如上图视频中实时识别。 可理解性 深度学习就像一个黑盒子，每一层代表一个特征，里面的层多了，它所表示的特征就很难以理解。我们没法对训练出来的模型对于预测任务做一个合理的解释。机器学习则不存在这一问题，在决策树算法中，我们能将每一个规则都能列出来。 参考机器学习和深度学习的科普文：https://www.analyticsvidhya.com/blog/2017/04/comparison-between-deep-learning-machine-learning/ 常见的机器学习算法理解传统机器学习从一些观测（训练）样本出发，试图发现不能通过原理分析获得的规律，实现对未来数据行为或趋势的准确预测。 相关算法包括： K 近邻方法 决策树方法 三层人工神经网络方法 Adaboost算法 贝叶斯方法 逻辑回归 隐马尔科夫方法 支持向量机方法","link":"/2018/12/14/浅谈机器学习与深度学习中的算法原理-一/"}],"tags":[{"name":"年度总结","slug":"年度总结","link":"/tags/年度总结/"},{"name":"deep learning","slug":"deep-learning","link":"/tags/deep-learning/"},{"name":"数据标注","slug":"数据标注","link":"/tags/数据标注/"},{"name":"博客搭建","slug":"博客搭建","link":"/tags/博客搭建/"},{"name":"machine learning","slug":"machine-learning","link":"/tags/machine-learning/"}],"categories":[{"name":"生活随笔","slug":"生活随笔","link":"/categories/生活随笔/"},{"name":"课程笔记","slug":"课程笔记","link":"/categories/课程笔记/"},{"name":"技术杂谈","slug":"技术杂谈","link":"/categories/技术杂谈/"},{"name":"算法原理","slug":"算法原理","link":"/categories/算法原理/"}]}